/****************************************Copyright (c)**************************************************
**                               广州周立功单片机发展有限公司
**                                     研    究    所
**                                        产品一部 
**                                 http://www.zlgmcu.com
**-----------------------------------------------------------文件信息--------------------------------------------------------------------------------
**	文   件  	名:	CUSTOM.H
** 	版  		本:	v1.0
** 	日		期:	2004年3月2日
**	描		述:	用户特殊选项配置头文件
********************************************************************************************************/
#ifndef	_CUSTOM_H_
#define	_CUSTOM_H_
//当VPB时钟为4*11059200Hz时，常用波特率与总线时序器对照表,如果VPB时钟不等，请自己计算出总线时序器的值
//BPS = (SAM << 23)|(TSEG2 << 20)|(TSEG1 << 16)|(SJW << 14)| BRP
#define	BPS_5K			(1 << 23)|(1 << 20)|(6 << 16)|(0 << 14)| 879
#define	BPS_10K			(1 << 23)|(1 << 20)|(6 << 16)|(0 << 14)| 439
#define	BPS_20K			(1 << 23)|(1 << 20)|(6 << 16)|(0 << 14)| 219
#define	BPS_40K			(1 << 23)|(1 << 20)|(6 << 16)|(0 << 14)| 109
#define	BPS_50K			(1 << 23)|(1 << 20)|(6 << 16)|(0 << 14)| 87
#define	BPS_80K			(1 << 23)|(1 << 20)|(4 << 16)|(0 << 14)| 68
#define	BPS_100K		(1 << 23)|(1 << 20)|(6 << 16)|(0 << 14)| 43
#define	BPS_125K		(0 << 23)|(1 << 20)|(4 << 16)|(0 << 14)| 43
#define	BPS_200K		(0 << 23)|(1 << 20)|(6 << 16)|(0 << 14)| 21
#define	BPS_250K		(0 << 23)|(1 << 20)|(4 << 16)|(0 << 14)| 21
#define BPS_400K		(0 << 23)|(1 << 20)|(6 << 16)|(0 << 14)| 10
#define BPS_500K		(0 << 23)|(1 << 20)|(4 << 16)|(0 << 14)| 10
#define BPS_666K		(0 << 23)|(1 << 20)|(2 << 16)|(0 << 14)| 10
#define BPS_800K		(0 << 23)|(1 << 20)|(1 << 16)|(0 << 14)| 10
#define	BPS_1000K		(0 << 23)|(1 << 20)|(1 << 16)|(0 << 14)| 8
//全局应用定义
#define	CAN_MAX_NUM				2					// 微处理器所含有的最大CAN模块的数目
#define	CAN_OFFSET_ADR			0x4000				// CAN各模块寄存器之间的线性差异
#define	AF_REG_ENABLE			0x00				// 是否使用验收过滤功能
/***********************
AF_REG_ENABLE= 1 时有效
************************/
#define	SFF_INDV_nCell			0					// 标准帧滤波单元个数		
#define	SFF_GRP_nCell			0					// 标准帧范围滤波单元个数
#define	EFF_INDV_nCell			0					// 单个扩展帧滤波单元个数
#define	EFF_GRP_nCell			0					// 扩展帧范围滤波表格单元个数
//**********************
#define	USE_CAN_cycRCV_BUF_SIZE	50					// 接收环形缓冲区的大小
//各路CAN独立应用定义
#define	USE_LOM_CAN1			0x00				// CAN模块1的只听模式设置
#define	USE_LOM_CAN2			0x00				// CAN模块2的只听模式设置

#define	USE_EWL_CAN1			0x60				// CAN模块1的错误报警界限值
#define	USE_EWL_CAN2			0x60				// CAN模块2的错误报警界限值

#define	USE_INT_CAN1			0x09				// CAN模块1的中断使能方式
#define	USE_INT_CAN2			0x09				// CAN模块2的中断使能方式

#define	USE_TPM_CAN1			0x00				// CAN模块1的发送优先级模式
#define	USE_TPM_CAN2			0x00				// CAN模块2的发送优先级模式

#define	USE_BTR_CAN1			BPS_1000K			// CAN模块1的总线波特率
#define	USE_BTR_CAN2			BPS_1000K			// CAN模块2的总线波特率

#define	USE_SLP_MOD_CAN1		0x00				// CAN模块1的睡眠方式
#define	USE_SLP_MOD_CAN2		0x00				// CAN模块2的睡眠方式

#endif
/*********************************************************************************************************
**                            				End Of File
********************************************************************************************************/
